In [60]:
import os
os.chdir("C:\\Users\\Venki\\Desktop\\data science\\All data")

In [61]:
import pandas as pd
import scipy as sp
import numpy as np
from scipy import stats
from scipy.stats import ttest_ind
import matplotlib.pyplot as plt
import scipy.stats as stats
from scipy.stats import chi2_contingency,chisquare
from scipy.stats import chi2

# 1st question

In [62]:
df=pd.read_csv("Cutlets.csv")

In [63]:
df.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [64]:
x=df.iloc[:,0]
y=df.iloc[:,1]

In [65]:
x

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [66]:
y

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

In [67]:
A=np.mean(x)
B=np.mean(y)

In [68]:
A

7.01909142857143

In [69]:
B

6.964297142857142

In [70]:
scipy.stats.ttest_ind(x,y)

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

here p value is more than significance value hence we accept null hypothesis

# 2nd question

In [71]:
lab=pd.read_csv("LABTAT.csv")

In [72]:
lab.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [73]:
lab.columns=['x','y','q','p']

In [74]:
lab.head()

        x       y       q       p
0  185.35  165.53  176.70  166.13
1  170.49  185.91  198.45  160.79
2  192.77  194.92  201.23  185.18
3  177.33  183.00  199.61  176.42
4  193.41  169.57  204.63  152.60

In [75]:
array=lab.values

In [76]:
x=array[:,0]
y=array[:,1]
q=array[:,2]
p=array[:,3]

In [77]:
stats.f_oneway(x,y,q,p)

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

here p valuve is less than significance value hence we accept alternate hypothesis

# 3rd question

In [78]:
ls

 Volume in drive C has no label.
 Volume Serial Number is B6B1-F973

 Directory of C:\Users\Venki\Desktop\data science\All data

15-12-2022  08:48    <DIR>          .
15-12-2022  08:48    <DIR>          ..
10-09-2022  16:09             2,436 50_Startups.csv
12-09-2022  16:54             9,559 Airlines+Data.xlsx
12-09-2022  16:35         4,610,348 bank-full.csv
24-06-2022  10:32           103,983 BEML.csv
24-06-2022  10:32            87,155 beml_df.csv
12-09-2022  16:42           536,483 book(rs).csv
12-09-2022  16:41            46,094 book.csv
19-08-2022  16:03                87 BuyerRatio.csv
13-09-2022  13:31             3,529 Cars.csv
12-09-2022  16:54             9,422 CocaCola_Sales_Rawdata.xlsx
12-09-2022  16:47            17,023 Company_Data.csv
13-09-2022  13:31           252,761 Computer_Data.csv
19-08-2022  16:03            13,423 Costomer+OrderForm.csv
12-09-2022  16:40             1,328 crime_data.csv
19-08-2022  16:03               525 Cutlets.csv
13-12-2022  07:31             5,311 data_clean.csv
09-09-2022  15:36               218 delivery_time.csv
12-09-2022  16:39           268,963 EastWestAirlines.xlsx
12-09-2022  16:45           170,848 Elon_musk.csv
12-09-2022  16:51            46,843 forestfires.csv
12-09-2022  16:47            21,837 Fraud_check.csv
12-09-2022  16:51         1,155,536 gas_turbines.csv
18-06-2022  12:40           394,240 gcapi.dll
12-09-2022  16:47            10,053 glass.csv
24-06-2022  10:31           107,633 GLAXO.csv
24-06-2022  10:31            88,939 glaxo_df.csv
19-08-2022  16:03             3,487 LabTAT.csv
24-06-2022  10:31             1,336 mtcars.csv
12-09-2022  16:41               767 my_movies.csv
15-12-2022  08:47             1,240 NewspaperData.csv
13-09-2022  13:31               962 Q7.csv
13-09-2022  13:31               502 Q9_a.csv
13-09-2022  13:31             2,420 Q9_b.csv
09-09-2022  15:36               454 Salary_Data.csv
12-09-2022  16:51         1,694,474 SalaryData_Test(1).csv
12-09-2022  16:46         1,694,474 SalaryData_Test.csv
12-09-2022  16:51         3,393,618 SalaryData_Train(1).csv
12-09-2022  16:46         3,393,618 SalaryData_Train.csv
10-09-2022  16:09           224,041 ToyotaCorolla.csv
13-09-2022  13:31             1,172 wc-at.csv
12-09-2022  16:41            11,425 wine.csv
12-09-2022  16:47             4,600 Zoo.csv
              42 File(s)     18,393,167 bytes
               2 Dir(s)  158,849,474,560 bytes free

In [79]:
sales=pd.read_csv("BuyerRatio.csv")

In [80]:
sales

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [81]:
sales.values

array([['Males', 50, 142, 131, 70],
       ['Females', 435, 1523, 1356, 750]], dtype=object)

In [82]:
s=sales[['East','West','North','South']]
s

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [83]:
alpha=0.05
female=[50,142,131,70]
male=[435,1523,1356,750]
Sales=[male,female]
print(Sales)

[[435, 1523, 1356, 750], [50, 142, 131, 70]]

In [85]:
chiStats = sp.stats.chi2_contingency(Sales)
print('Test t=%f p-value=%f' % (chiStats[0], chiStats[1]))
print('Interpret by p-Value')
if chiStats[1] < 0.05:
  print('we reject null hypothesis')
else:
  print('we accept null hypothesis')

Test t=1.595946 p-value=0.660309
Interpret by p-Value
we accept null hypothesis

# Q4

In [86]:
COF=pd.read_csv('Costomer+OrderForm.csv')

In [87]:
COF.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [89]:
ph=COF.Phillippines.value_counts()
indo=COF.Indonesia.value_counts()
ma=COF.Malta.value_counts()
ind=COF.India.value_counts()

In [90]:
ph

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [91]:
indo

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [92]:
ma

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [93]:
ind

Error Free    280
Defective      20
Name: India, dtype: int64

In [94]:
error_free=[271,267,269,280]
defective=[29,33,31,20]

In [95]:
ed=(error_free,defective)
ed

([271, 267, 269, 280], [29, 33, 31, 20])

In [96]:
chiStats = sp.stats.chi2_contingency(ed)
print('Test t=%f p-value=%f' % (chiStats[0], chiStats[1]))
print('Interpret by p-Value')
if chiStats[1] < 0.05:
  print('we reject null hypothesis')
else:
  print('we accept null hypothesis')

Test t=3.858961 p-value=0.277102
Interpret by p-Value
we accept null hypothesis